app/controllers/users_controller.rb

  def create
    @user = User.new(
      email: user_params[:email],
      username: user_params[:username],
      password: user_params[:password],
      password_confirmation: user_params[:password_confirmation]
    )
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = current_user

    @user.email = user_params[:email]
    @user.username = user_params[:username]
    @user.password = user_params[:password]
    @user.password_confirmation = user_params[:password_confirmation]

    if @user.save
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "BIGE"], ["updated_at", "2018-01-08 20:06:38.745694"], ["id", 2]]

  def destroy
    @user = current_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]